//Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в
//3D пространстве.
//A (3,6,8); B (2,1,-7), -> 15.84
//A (7,-5, 0); B (1,-1,9) -> 11.53




//int[] mass1 = {3, 6, 8, 2, 1, -7};
int[] mass1 = {7, -5, 0, 1, -1, 9};

double masR = Math.Sqrt(Math.Pow(mass1[0]-mass1[3], 2) + Math.Pow(mass1[1]-mass1[4], 2) + Math.Pow(mass1[2] - mass1[5], 2));
Console.WriteLine($"{masR:f2}");